In [97]:
import pandas as pd
data = pd.read_csv("C:/Users/matur/OneDrive/Project/the_analysis_of_uber_transportation/script/cleaning data/transformed_uber_data.csv")
df = pd.DataFrame(data)

In [98]:
# Create passenger-count_dim table
passenger_count = [0, 1, 2, 3, 4, 5, 6]
passenger_count_id = [1, 2, 3, 4, 5, 6, 7]
df_passenger = pd.DataFrame({'passenger_count_id': passenger_count_id, 'passenger_count': passenger_count})
df_passenger.to_csv("passenger_count_dim.csv", index=False)
df_passenger

   passenger_count_id  passenger_count
0                   1                0
1                   2                1
2                   3                2
3                   4                3
4                   5                4
5                   6                5
6                   7                6

In [99]:
# Create rate_code_dim table
ratecodeid = [1, 2, 3, 4, 5, 6]
rate_code_id = [1, 2, 3, 4, 5, 6]
rate_code_name = ['Standard rate', 'JFK', 'Newark', 'Nassau or Westchester', 'Negotiated fare', 'Group ride']
df_ratecode = pd.DataFrame({'rate_code_id' : rate_code_id, 'ratecodeid' : ratecodeid, 'rate_code_name' : rate_code_name})
df_ratecode.to_csv("rate_code_dim.csv", index=False)
df_ratecode

   rate_code_id  ratecodeid         rate_code_name
0             1           1          Standard rate
1             2           2                    JFK
2             3           3                 Newark
3             4           4  Nassau or Westchester
4             5           5        Negotiated fare
5             6           6             Group ride

In [100]:
# Create payment_type_dim table
payment_type = [1, 2, 3, 4, 5, 6]
payment_type_id = [1, 2, 3, 4, 5, 6]
payment_type_name = ['Credit card', 'Cash', 'No charge', 'Dispute', 'Unknown', 'Voided trip']
df_payment_type = pd.DataFrame({'payment_type_id': payment_type_id, 'payment_type': payment_type, 'payment_type_name': payment_type_name})
df_payment_type.to_csv("payment_type_dim.csv", index = False)
df_payment_type

   payment_type_id  payment_type payment_type_name
0                1             1       Credit card
1                2             2              Cash
2                3             3         No charge
3                4             4           Dispute
4                5             5           Unknown
5                6             6       Voided trip

In [157]:
# Create pick_up_location_dim table
df_pickup_location = pd.DataFrame({'pickup_latitude': pickup_latitude, 'pickup_longitude': pickup_longitude})
df_pickup_location  = df_pickup_location.drop_duplicates()
df_pickup_location

       pickup_latitude  pickup_longitude
0            40.765152        -73.976746
1            40.767925        -73.983482
2            40.644810        -73.782021
3            40.769814        -73.863419
4            40.792183        -73.971741
...                ...               ...
98908        40.750519        -73.990898
98909        40.718296        -74.014488
98910        40.774097        -73.963379
98911        40.763111        -73.984901
98912        40.750473        -73.990685

[97961 rows x 2 columns]